hiro22022/ASP3_STM32H747_DISCO/obj_h747/main_no_sprintf.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();
/* USER CODE BEGIN Boot_Mode_Sequence_2 */
  /* When system initialization is finished, Cortex-M7 will release Cortex-M4 by means of
  HSEM notification */
  /*HW semaphore Clock enable*/
  __HAL_RCC_HSEM_CLK_ENABLE();
  /*Take HSEM */
  HAL_HSEM_FastTake(HSEM_ID_0);
  /*Release HSEM in order to notify the CPU2(CM4)*/
  HAL_HSEM_Release(HSEM_ID_0,0);
  /* wait until CPU2 wakes up from stop mode */
  timeout = 0xFFFF;
  while((__HAL_RCC_GET_FLAG(RCC_FLAG_D2CKRDY) == RESET) && (timeout-- > 0));
  if ( timeout < 0 )
  {
    Error_Handler();
  }
/* USER CODE END Boot_Mode_Sequence_2 */

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_TIM2_Init();
  MX_TIM5_Init();
  /* USER CODE BEGIN 2 */
#define MSG_CM7 "hello CM7!\r\n"
  HAL_UART_Transmit(&huart1, (uint8_t*)MSG_CM7, sizeof(MSG_CM7), 0xfffffff);

  //-------------------------
  // print clock frequency calculated from register settings
  uint32_t   clk_val;
  char  buf[32];
  clk_val = HAL_RCC_GetSysClockFreq();
  snprintf( buf, sizeof(buf), "SysClockFreq=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCC_GetHCLKFreq();
  snprintf( buf, sizeof(buf), "HClockFreq=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCC_GetPCLK1Freq();
  snprintf( buf, sizeof(buf), "P1ClockFreq=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCC_GetPCLK2Freq();
  snprintf( buf, sizeof(buf), "P2ClockFreq=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCCEx_GetD1SysClockFreq();
  snprintf( buf, sizeof(buf), "D1SysCloc=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCCEx_GetD1PCLK1Freq();
  snprintf( buf, sizeof(buf), "D1PCLK1=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  clk_val = HAL_RCCEx_GetD3PCLK1Freq();
  snprintf( buf, sizeof(buf), "D3PCLK1=%lu\r\n", clk_val );
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 0xfffffff);
  //-------------------------

  led_init();
  int  i, j = 0;
  for( j = 0; j < 16; j++ ){
    for( i = 0; i < 100 * 1000; i++ ){
      /* 単純なループだと消される可能性があるので、値が変わらなくても毎回呼出す */
      /* 時間を延ばす役割もある */
      led_set( j );
    }
  }

#define MSG_LED1 "LED1!\r\n"
  HAL_UART_Transmit(&huart1, (uint8_t*)MSG_LED1, sizeof(MSG_LED1), 0xfffffff);

  for(j=0; j<64; ){
    if( __HAL_TIM_GET_COUNTER(&htim2) % 100000 == 0 ){
      led_set( j );
      j++;
    }
  }
#define MSG_LED2 "LED2!\r\n"
  HAL_UART_Transmit(&huart1, (uint8_t*)MSG_LED2, sizeof(MSG_LED2), 0xfffffff);

#define MSG_TIM3 "hello CM7 Enable Interrupt!\r\n"
  HAL_UART_Transmit(&huart1, (uint8_t*)MSG_TIM3, sizeof(MSG_TIM3), 0xfffffff);

  /* 割込み許可 */
  __enable_irq();
  /* TIM5 Interrupt Vector Number = TIM_CLK_IRQNO */
  NVIC_EnableIRQ( TIM_CLK_IRQNO );
  NVIC_EnableIRQ( USART1_IRQn );

#ifndef OnePulseF401
  /* USER CODE BEGIN TIM5_Init 2 */
  /* カウンターをスタート */
  if(HAL_TIM_Base_Start_IT(&htim_clk) != HAL_OK) {
    /* Initialization Error */
#define MSG_BASE_START_ERR "HAL_TIM_Base_Start Error\r\n"
    HAL_UART_Transmit(&huart1, (uint8_t*)MSG_BASE_START_ERR, sizeof(MSG_BASE_START_ERR), 0xfffffff);
    Error_Handler();
  }
#define MSG_HAL_TIM_INIT_DONE "HAL_TIM_Base_Start Done\r\n"
  HAL_UART_Transmit(&huart1, (uint8_t*)MSG_HAL_TIM_INIT_DONE, sizeof(MSG_HAL_TIM_INIT_DONE), 0xfffffff);
#ifdef USE_EGR
	htim_clk.Instance->EGR = TIM_EVENTSOURCE_UPDATE;
#endif // EGR
#endif // OnePulseF401

  /* USER CODE END TIM5_Init 2 */
  for(j=0; j<64; ){
    if( __HAL_TIM_GET_COUNTER(&htim_clk) % 1000000 == 0 ){
      led_set( j );
      j++;
    }
  }
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  for (i = 0; ; i++ )
  {
    /* USER CODE END WHILE */
    if( tim_clk_count % COUNT_BASE == 333 ){
      snprintf( buf, sizeof(buf), "tim_clk_count=%lu i=%d\r\n", tim_clk_count/COUNT_BASE, i );
      led_set( tim_clk_count / COUNT_BASE );
//      HAL_UART_Transmit(&huart1, (uint8_t*)buf, strnlen(buf, sizeof(buf)), 0xfffffff);
      HAL_UART_Transmit_IT(&huart1, (uint8_t*)buf, strnlen(buf, sizeof(buf)));
      led_set( (tim_clk_count / COUNT_BASE) +1 );
    }
    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_DIRECT_SMPS_SUPPLY);
  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}
  /** Macro to configure the PLL clock source
  */

  /* なぜかこの行があったが、不要と思われる */
  //  __HAL_RCC_PLL_PLLSOURCE_CONFIG(RCC_PLLSOURCE_HSI);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  /* Clock Security System Enable */
  HAL_RCC_EnableCSS();

  /*
   * HSE を有効にする
   * PLL 発振周波数を 320MHz とする HSE を 5分周、VCO を 128分周
   * sysclk を PLL とする (320MHz)
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;  // RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 5;     /* HSE divider 25MHz/5 => 5MHz */
  RCC_OscInitStruct.PLL.PLLN = 128;   /* VCO divider 640MHz/128 => 5MHz*/
  RCC_OscInitStruct.PLL.PLLP = 2;     /* P: 640MHz/2 => 320MHz (System Clock Source) */
  RCC_OscInitStruct.PLL.PLLQ = 8;     /* Q: 640MHz/8 => 80MHz */
  RCC_OscInitStruct.PLL.PLLR = 4;     /* R: 640MHz/4 => 160MHz */
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_2;  /* 4-8MHz */  // RCC_PLL1VCIRANGE_1; /* 2-4MHz */
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE; 
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;       /* System Clock : PLL */
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;   // 320MHz  /* set D1CPRE which affects Cortex M7 Clock */
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV4;     // 80MHz   /* set HPRE which afects Cortex M4 clock */
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;    // 40MHz
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;               /* APB1, Timer TIMX clock */
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;               /* APB2, Timer TIMY clock */
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;	              /* */

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC|RCC_PERIPHCLK_USART1
                              |RCC_PERIPHCLK_UART8|RCC_PERIPHCLK_SPDIFRX
                              |RCC_PERIPHCLK_SPI5|RCC_PERIPHCLK_SPI2
                              |RCC_PERIPHCLK_SAI1|RCC_PERIPHCLK_SDMMC
                              |RCC_PERIPHCLK_ADC|RCC_PERIPHCLK_CEC
                              |RCC_PERIPHCLK_QSPI|RCC_PERIPHCLK_FMC;
  PeriphClkInitStruct.PLL2.PLL2M = 12; // 32;  // 2.08MHz
  PeriphClkInitStruct.PLL2.PLL2N = 129;
  PeriphClkInitStruct.PLL2.PLL2P = 2;
  PeriphClkInitStruct.PLL2.PLL2Q = 2;
  PeriphClkInitStruct.PLL2.PLL2R = 2;
  PeriphClkInitStruct.PLL2.PLL2RGE = RCC_PLL2VCIRANGE_1;
  PeriphClkInitStruct.PLL2.PLL2VCOSEL = RCC_PLL2VCOWIDE;
  PeriphClkInitStruct.PLL2.PLL2FRACN = 0;
  PeriphClkInitStruct.FmcClockSelection = RCC_FMCCLKSOURCE_D1HCLK;
  PeriphClkInitStruct.QspiClockSelection = RCC_QSPICLKSOURCE_D1HCLK;
  PeriphClkInitStruct.SdmmcClockSelection = RCC_SDMMCCLKSOURCE_PLL;
  PeriphClkInitStruct.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLL;
  PeriphClkInitStruct.Spi123ClockSelection = RCC_SPI123CLKSOURCE_PLL;
  PeriphClkInitStruct.Spi45ClockSelection = RCC_SPI45CLKSOURCE_D2PCLK1;
  PeriphClkInitStruct.SpdifrxClockSelection = RCC_SPDIFRXCLKSOURCE_PLL;
  PeriphClkInitStruct.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_D2PCLK1;
  PeriphClkInitStruct.Usart16ClockSelection = RCC_USART16CLKSOURCE_D2PCLK2;
  PeriphClkInitStruct.CecClockSelection = RCC_CECCLKSOURCE_LSI;
  PeriphClkInitStruct.AdcClockSelection = RCC_ADCCLKSOURCE_PLL2;
  PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSI, RCC_MCODIV_1);
}

